#+TITLE:Literate Programming using SMUG
#+BIND: org-src-fontify-natively t
** To a file

In the example of [[*The%20Source%20Blocks][The Source Blocks]], we can see that code block is tangled to a file.

#+BEGIN_SRC org
  ,#+BEGIN_SRC lisp :tangle "/tmp/first-org-source-block.lisp" :padline no
    (first (smug/literate/tangle:source-blocks 
             (merge-pathnames #P"quicklisp/local-projects/smug/literate/literate.org"
                              (user-homedir-pathname))))
  ,#+END_SRC
#+END_SRC

So, when this file is tangled, the =#P\"/tmp/first-org-source-block.lisp\"\=
#+NAME: tangle-this-file
#+BEGIN_SRC lisp
  (smug/literate/tangle:tangle-file 
   (merge-pathnames #P"quicklisp/local-projects/smug/literate/literate.org"
                    (user-homedir-pathname)))
#+END_SRC

#+BEGIN_SRC sh :results output
cat /tmp/first-org-source-block.lisp
#+END_SRC

#+RESULTS:
: (first (smug/literate/tangle:source-blocks 
:         (merge-pathnames #P"quicklisp/local-projects/smug/literate/literate.org"
:                          (user-homedir-pathname))))


